// ************************************************************
// fliename	CwnDecoder.h
// brief	独自フォーマット読込
// name		川口　裕
// memo
// 2013.08.21
// ************************************************************

// 多重インクルード防止 ***************************************
#ifndef	_CWN_DECODER_H_
#define	_CWN_DECODER_H_

// インクルード ***********************************************


// 前方宣言 ***************************************************
struct	MeshData;
struct  MeshVertex;
struct	MeshMaterial;
struct  MeshTextures;
struct  CwnMesh;
class	Shader;
struct	ModelConstantBuffer;
struct	ModelSkinConstantBuffer;


// ************************************************************
// class	CwnDecoder
// brief	独自フォーマット読込
// ************************************************************
class CwnDecoder{
private:
	MeshData*		meshData;	// メッシュデータ

	char*			filePath;	// ファイルパス(モデル読込用)
	wchar_t*		rootPath;	// ルートパス(テクスチャ用)

	// ************************************************************
	// struct	CwnVertex
	// brief	読込用バーテクス
	// ************************************************************
	struct CwnVertex
	{
		float			pos[ 3 ];
		float			normal[ 3 ];
		float			uv[ 2 ];
		float			weight[ 4 ];
		unsigned int	matrixIndex[ 4 ];
	};

	// ************************************************************
	// struct	CwnMaterial
	// brief	読込用材質
	// ************************************************************
	struct CwnMaterial
	{
		float			ambient[ 3 ];		// アンビエント
		float			diffuse[ 3 ];		// ディフューズ
		float			specular[ 3 ];		// スペキュラ
		float			alpha;				// 透過
		float			power;				// パワー
		unsigned int	numFace;			// 面数
		char			textureFileName[ 20 ];
	};

public:
	// ************************************************************
	// コンストラクタ
	// ************************************************************
	CwnDecoder();

	// ************************************************************
	// デストラクタ
	// ************************************************************
	~CwnDecoder();

	// ************************************************************
	// 解放
	// ************************************************************
	void Release();

	// ************************************************************
	// 読込
	// ************************************************************
	bool LoadCwn( char* filename, char* path );

	// ************************************************************
	// メッシュデータの取得
	// ************************************************************
	MeshData* GetMesh();

	// ************************************************************
	// テクスチャのアタッチ
	// ************************************************************
	bool SetAttachingTexture( const MeshTextures* textures );

private:
	// ************************************************************
	// バーテクスの読込
	// ************************************************************
	void LoadVertex( MeshVertex* outVert, CwnVertex* inVert, unsigned long numVert );

	// ************************************************************
	// インデックスの読込
	// ************************************************************
	void LoadIndex( unsigned short* inIndex, int inNum );

	// ************************************************************
	// 材質の読込
	// ************************************************************
	void LoadMaterial( CwnMesh* outMesh, CwnMaterial* inMaterial );

	// ************************************************************
	// マテリアルのコピー
	// ************************************************************
	void CopyMaterial( MeshMaterial& outMaterial, CwnMaterial& inMaterial );

};

// メッシュデータの取得
inline MeshData* CwnDecoder::GetMesh()
{
	return meshData;
}

#endif