// ************************************************************
// fliename	ModelSkinShader.h
// brief	モデルの静的シェーダ
// name		川口　裕
// note
// 2014.10.19
// ************************************************************

// 多重インクルード防止 ***************************************
#ifndef	_MODEDL_SKIN_SHADER_H_
#define	_MODEDL_SKIN_SHADER_H_

// インクルード ***********************************************
#include "Shader/Shader.h"
#include <memory>
#include "Graphic/Buffer/ConstantBuffer.h"


// ************************************************************
// struct	ModelSkinDatas
// brief	モデルの静的シェーダに使用するコンスタントバッファ
// ************************************************************
struct ModelSkinDatas : public ConstantDataBase
{
	struct GameData
	{
		D3DXMATRIX	world;
		D3DXMATRIX	wvp;
		D3DXMATRIX	bone[ 255 ];
	}data;
};

// ************************************************************
// class	ModelStaticShader
// brief	モデルの静的シェーダ
// ************************************************************
class ModelSkinShader : public Shader
{
private:
	ConstantBuffer buffer;

public:
	// ************************************************************
	// コンストラクタ
	// ************************************************************
	ModelSkinShader ();

	// ************************************************************
	// デストラクタ
	// ************************************************************
	~ModelSkinShader ();

	// ************************************************************
	// コンパイル
	// ************************************************************
	HRESULT Compile ();

	// ************************************************************
	// パラメータのセット
	// ************************************************************
	void SetParameters ( ConstantDataBase* );

};

extern ModelSkinDatas modelSkinDatas;

#endif